<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta name="generator" content="HTML Tidy, see www.w3.org" />

    <title>Ayuda de DIV 2 - Definici&oacute;n de un nombre</title>
    <meta name="keywords" content="div, div2" />
    <meta name="description" content="Ayuda en pantalla de DIV Games Studio 2" />
    <meta http-equiv="Content-Language" content="ES" />
    <meta name="author" content="Hammer Technologies" />
    <meta name="copyright" content="&copy; Copyright 1998,99 Hammer Technologies" />
    <meta name="generator" content="divhelp v0.1 &copy; 2007 Er_Makina" />
    <meta name="robots" content="all,follow,index" />
    <meta name="distribution" content="global" />
    <link href="estilo.css" rel="stylesheet" type="text/css" />
  </head>

  <body>
    <div class="botonera">
      <ul>
        <li><a class="botonindice" href="indice.html">&Iacute;ndice</a></li>

        <li><a class="botoninicio" href="3.html">Inicio</a></li>

        <li><a class="botonglosario" href="4.html">Glosario</a></li>

        <li><a class="botonfunciones" href="1032.html">Funciones</a></li>
      </ul>
    </div>

    <h1>Definici&oacute;n de un nombre</h1>

    <p>Un nombre es una secuencia de car&aacute;cteres alfanum&eacute;ricos que se utiliza para
    <strong>identificar</strong> un objeto del programa, como puede ser el nombre de un proceso, de
    una <a href="1004.html">constante</a> o de una variable.</p>

    <p>Estos nombres pueden formarse con los siguientes car&aacute;cteres:</p>

    <p>&nbsp;&nbsp;S&iacute;mbolos:<br />
    &nbsp;&nbsp;<strong>_ # &ordf; &ordm; $ &times; &pound; &Oslash; &oslash;</strong><br />
    &nbsp;&nbsp;D&iacute;gitos:<br />
    &nbsp;&nbsp;<strong>0123456789</strong><br />
    &nbsp;&nbsp;Letras:<br />
    &nbsp;&nbsp;<strong>abcdefghijklmnopqrstuvwxyz</strong><br />
    &nbsp;&nbsp;Letras (extendido):<br />
    &nbsp;&nbsp;<strong>&ntilde; &ccedil; &aelig; &acirc;&auml;&agrave;&aring;&aacute;
    &ecirc;&euml;&egrave;&eacute; &icirc;&iuml;&igrave;&iacute; &ocirc;&ouml;&ograve;&oacute;
    &ucirc;&uuml;&ugrave;&uacute; &yuml;</strong><br />
    </p>

    <p>Siempre que se respeten las siguientes reglas para construir nuevos nombres:</p>

    <p>- La secuencia de car&aacute;cteres no debe contener car&aacute;cteres que no est&eacute;n
    en la relaci&oacute;n anterior (excepto las letras <strong>may&uacute;sculas</strong>
    correspondientes a las min&uacute;sculas de la lista).</p>

    <p>- Dentro de la secuencia no se pueden poner espacios en blanco, es decir, no es
    v&aacute;lido como nombre <strong>nave enemiga</strong>, pues para el compilador se
    tratar&iacute;a de dos nombres; en este caso se puede declarar el nombre como
    <strong>nave_enemiga</strong>.</p>

    <p>- Un nombre no puede comenzar por un d&iacute;gito num&eacute;rico, es decir,
    <strong>0a</strong> no es un nombre v&aacute;lido. No obstante tras el primer car&aacute;cter,
    pueden incluirse en el nombre todos los d&iacute;gitos necesarios (<strong>a0</strong> si es un
    nombre v&aacute;lido).</p>

    <p>- El nombre no debe coincidir con ninguna de las palabras reservadas del lenguaje ni con
    ninguno de los objetos (constantes, variables, etc.) predefinidos en el lenguaje. Para
    comprobar esto, ver la lista de palabras reservadas y objetos predefinidos, pudi&eacute;ndose
    acceder al glosario en cualquier momento. Las palabras reservadas aparecen en may&uacute;sculas
    y los objetos predefinidos en min&uacute;sculas.</p>

    <p>- No se diferencian las letras may&uacute;sculas de las m&iacute;nusculas
    (<strong>ABc</strong> y <strong>abC</strong> son el mismo nombre para el compilador).</p>

    <p>- No se puede utilizar un mismo nombre para dos objetos diferentes, por ejemplo, no se puede
    llamar a una constante <strong>valor</strong> y, despu&eacute;s, declarar un proceso como
    <strong>PROCESS valor(x, y);</strong>.</p>
    <hr />
    Ver: <a href="1000.html">Sintaxis</a>
  </body>
</html>

