<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta name="generator" content="HTML Tidy, see www.w3.org" />

    <title>Ayuda de DIV 2 - =</title>
    <meta name="keywords" content="div, div2" />
    <meta name="description" content="Ayuda en pantalla de DIV Games Studio 2" />
    <meta http-equiv="Content-Language" content="ES" />
    <meta name="author" content="Hammer Technologies" />
    <meta name="copyright" content="&copy; Copyright 1998,99 Hammer Technologies" />
    <meta name="generator" content="divhelp v0.1 &copy; 2007 Er_Makina" />
    <meta name="robots" content="all,follow,index" />
    <meta name="distribution" content="global" />
    <link href="estilo.css" rel="stylesheet" type="text/css" />
  </head>

  <body>
    <div class="botonera">
      <ul>
        <li><a class="botonindice" href="indice.html">&Iacute;ndice</a></li>

        <li><a class="botoninicio" href="3.html">Inicio</a></li>

        <li><a class="botonglosario" href="4.html">Glosario</a></li>

        <li><a class="botonfunciones" href="1032.html">Funciones</a></li>
      </ul>
    </div>

    <h1>=</h1>

    <p>El s&iacute;mbolo <strong>=</strong> (s&iacute;mbolo de <strong>asignaci&oacute;n</strong>)
    se utiliza en el lenguaje dentro de las <a href="1009.html">declaraciones de datos</a> para
    inicializarlos, es decir, para definir el valor inicial de los mismos y en las <a
    href="1019.html">sentencias de asignaci&oacute;n</a> para separar la referencia al dato, de la
    expresi&oacute;n asignada.</p>

    <p>Dentro de una expresi&oacute;n este operador se puede utilizar como un operador
    aritm&eacute;tico binario convencional, que se sit&uacute;a entre dos operandos, y devuelve
    como resultado el valor del segundo operando (adem&aacute;s de realizar la asignaci&oacute;n de
    este resultado al dato reflejado como primer operando).</p>

    <p>Este operador representa una <strong>orden imperativa</strong>; se ordena que, al ejecutarse
    la sentencia que lo contiene, el primer operando (anterior al s&iacute;mbolo) tome el valor que
    tiene el segundo operando (o expresi&oacute;n posterior al s&iacute;mbolo).</p>

    <p>En la evaluaci&oacute;n de una expresi&oacute;n los operandos de asignaci&oacute;n son
    siempre los de <strong>menor prioridad</strong> (los &uacute;ltimos que se interpretan en la
    expresi&oacute;n), pudiendo utilizar par&eacute;ntesis para forzar una prioridad mayor. Si en
    una expresi&oacute;n (o sentencia) se han utilizado varios operadores de asignaci&oacute;n,
    &eacute;stos ser&aacute;n evaluados (ejecutados) de derecha a izquierda.</p>

    <p>Por ejemplo, en la sentencia:</p>

    <p>&nbsp;&nbsp;<strong>x=y=x+y;</strong></p>

    <p>Primero se relizar&aacute; la suma (<strong>x+y</strong>), despu&eacute;s se asignar&aacute;
    el resultado como nuevo valor de la variable <strong>y</strong> (<strong>y=x+y</strong>) y, por
    &uacute;ltimo, se asignar&aacute; este mismo valor a la variable <strong>x</strong>
    (<strong>x=y</strong>).</p>
    <hr />
    Ver: <a href="1000.html">Sintaxis</a> - <a href="1009.html">Declaraciones de datos</a> - <a
    href="1019.html">Sentencias de asignaci&oacute;n</a>
  </body>
</html>

