<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta name="generator" content="HTML Tidy, see www.w3.org" />

    <title>Ayuda de DIV 2 - Puntos de control</title>
    <meta name="keywords" content="div, div2" />
    <meta name="description" content="Ayuda en pantalla de DIV Games Studio 2" />
    <meta http-equiv="Content-Language" content="ES" />
    <meta name="author" content="Hammer Technologies" />
    <meta name="copyright" content="&copy; Copyright 1998,99 Hammer Technologies" />
    <meta name="generator" content="divhelp v0.1 &copy; 2007 Er_Makina" />
    <meta name="robots" content="all,follow,index" />
    <meta name="distribution" content="global" />
    <link href="estilo.css" rel="stylesheet" type="text/css" />
  </head>

  <body>
    <div class="botonera">
      <ul>
        <li><a class="botonindice" href="indice.html">&Iacute;ndice</a></li>

        <li><a class="botoninicio" href="3.html">Inicio</a></li>

        <li><a class="botonglosario" href="4.html">Glosario</a></li>

        <li><a class="botonfunciones" href="1032.html">Funciones</a></li>
      </ul>
    </div>

    <h1>Puntos de control</h1>

    <div>
      <img src="141.png" align="left" />Los <strong>puntos de control</strong> se definen dentro
      del <strong>editor gr&aacute;fico</strong> con la barra de puntos de control, indicada con
      este icono.
    </div>
    <br />
    <br />

    <p>Para acceder al <strong>editor gr&aacute;fico</strong> basta con hacer
    "<strong>doble-click</strong>" con el rat&oacute;n (dos pulsaciones seguidas del bot&oacute;n
    izquierdo del rat&oacute;n) sobre un gr&aacute;fico dentro del entorno (sobre una ventana de un
    mapa).</p>

    <p>Los <strong>puntos de control</strong> son simplemente puntos que pueden localizarse dentro
    de un gr&aacute;fico, para diferentes funciones.</p>

    <p>La <strong>barra de puntos de control</strong> permite situar hasta <strong>1000</strong>
    puntos diferentes dentro de un gr&aacute;fico, cada uno ser&aacute; identificado por su
    n&uacute;mero (del <strong>0</strong> al <strong>999</strong>).</p>

    <p>Para situar uno de estos puntos, basta con seleccionar el <strong>n&uacute;mero de
    punto</strong> con los <strong>iconos flecha izquierda</strong> y <strong>flecha
    derecha</strong> y, despu&eacute;s, pulsar sobre el gr&aacute;fico.</p>

    <p>Para <strong>borrar</strong> (deseleccionar) un punto de control, se debe volver a pulsar
    sobre el mismo en el gr&aacute;fico una segunda vez.</p>
    <hr />

    <p>El &uacute;nico <strong>punto de control</strong> que utiliza el sistema es el punto de
    control n&uacute;mero <strong>0</strong> (el primero); &eacute;ste es el punto que define
    cu&aacute;l es el <strong>centro virtual del gr&aacute;fico</strong> y que tiene
    m&uacute;ltiples aplicaciones dentro del lenguaje.</p>

    <p>Cuando no se defina el <strong>punto de control n&uacute;mero 0</strong>, el sistema
    actuar&aacute; como si el centro virtual del gr&aacute;fico fuera el <strong>centro real del
    mismo</strong> (un punto situado en la mitad del ancho y la mitad del alto del
    gr&aacute;fico).</p>
    <hr />

    <p><strong>Nota:</strong> Una vez definidos los puntos de control, para que &eacute;stos tengan
    efecto dentro de un programa, debe grabarse el <strong>archivo MAP</strong> (en los archivos
    PCX no se pueden guardar los puntos de control) o volverse a incluir el gr&aacute;fico en el
    <strong>fichero FPG</strong> arrastr&aacute;ndolo hasta el mismo (seg&uacute;n cu&aacute;l de
    ambos se cargue en el programa).</p>
  </body>
</html>

