<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta name="generator" content="HTML Tidy, see www.w3.org" />

    <title>Ayuda de DIV 2 - Preguntas comunes sobre DIV</title>
    <meta name="keywords" content="div, div2" />
    <meta name="description" content="Ayuda en pantalla de DIV Games Studio 2" />
    <meta http-equiv="Content-Language" content="ES" />
    <meta name="author" content="Hammer Technologies" />
    <meta name="copyright" content="&copy; Copyright 1998,99 Hammer Technologies" />
    <meta name="generator" content="divhelp v0.1 &copy; 2007 Er_Makina" />
    <meta name="robots" content="all,follow,index" />
    <meta name="distribution" content="global" />
    <link href="estilo.css" rel="stylesheet" type="text/css" />
  </head>

  <body>
    <div class="botonera">
      <ul>
        <li><a class="botonindice" href="indice.html">&Iacute;ndice</a></li>

        <li><a class="botoninicio" href="3.html">Inicio</a></li>

        <li><a class="botonglosario" href="4.html">Glosario</a></li>

        <li><a class="botonfunciones" href="1032.html">Funciones</a></li>
      </ul>
    </div>

    <h1>Preguntas comunes sobre DIV</h1>

    <p><strong>&iquest;Donde puedo encontrar m&aacute;s informaci&oacute;n sobre DIV?</strong></p>

    <p>Existen muchos usuarios que est&aacute;n apoyando el programa con p&aacute;ginas en
    Internet, estas se pueden acceder a partir de <strong>WWW.DIVGAMES.COM</strong>, que es la
    p&aacute;gina oficial del producto. Adem&aacute;s existen <strong>listas de correo</strong>
    donde se solucionan problemas, y canales de CHAT sobre el lenguaje de programaci&oacute;n (el
    canal <strong>#div</strong> de IRC Hispano).</p>

    <p><strong>&iquest;Como obtener ayuda sobre ... ?</strong></p>

    <p>Todas las opciones accesibles desde cualquier men&uacute; de opciones se describen
    exclusivamente en el <strong>manual de usuario</strong> de DIV Games Studio 2.</p>

    <p><strong>&iquest;Como resolver un problema de configuraci&oacute;n?</strong></p>

    <p>Para problemas de sonido, instalaciones incompletas, etc., vea el apartado de <a
    href="2003.html">resoluci&oacute;n de problemas</a> de esta ayuda electr&oacute;nica.</p>

    <p><strong>&iquest;Cuales son las mejoras de esta versi&oacute;n?</strong></p>

    <p>Estas se dividen en dos grupos: las <a href="2001.html">novedades del lenguaje</a>
    (explicadas en esta <strong>ayuda</strong>), y las <a href="2002.html">novedades del
    entorno</a> (explicadas en el <strong>manual de usuario</strong>).</p>

    <p><strong>&iquest;Porqu&eacute; me dice "No se reconoce el tipo de fichero"?</strong></p>

    <p>Es posible que est&eacute; intentando cargar un archivo con el men&uacute; incorrecto, es
    decir, el men&uacute; de paletas s&oacute;lo sirve para cargar paletas, el de ficheros
    s&oacute;lo para cargar ficheros de gr&aacute;ficos (grupos de gr&aacute;ficos), el de
    programas para cargar programas o archivos de texto, etc.</p>

    <p>Tambi&eacute;n es posible que est&eacute; intentando cargar un mapa PCX o BMP True Color,
    esta versi&oacute;n de DIV &uacute;nicamente puede trabajar a 256 colores, no siendo posible
    importar este tipo de archivos. Deber&aacute; convertir el gr&aacute;fico que quiere cargar en
    DIV a 256 colores con otra herramienta primero.</p>

    <p><strong>&iquest;Como se debe arrastrar un gr&aacute;fico?</strong></p>

    <p>Para arrastrar un gr&aacute;fico se debe pulsar con el bot&oacute;n izquierdo del
    rat&oacute;n sobre la ventana del mapa, pero no sobre la barra de t&iacute;tulo, sino sobre el
    propio gr&aacute;fico contenido en la ventana. Despu&eacute;s bastar&aacute; con mover el
    rat&oacute;n hasta la posici&oacute;n en la que se desea dejar el gr&aacute;fico y soltar
    entonces el bot&oacute;n izquierdo (se pueden arrastrar mapas a ficheros, a la papelera, al
    tapiz de fondo, a otros mapas o al generador de fuentes).</p>

    <p><strong>&iquest;Como extraer un gr&aacute;fico contenido en otro?</strong></p>

    <div>
      <img src="126.png" align="left" />Se debe acceder a la barra de edici&oacute;n de bloques
      para seleccionar la parte del gr&aacute;fico que se quiere extraer. La selecci&oacute;n se
      puede realizar de varias formas, como un rect&aacute;ngulo, dibujando el contorno, etc.
    </div>
    <br />
    <br />

    <div>
      <img src="133.png" align="left" />Una vez realizada la selecci&oacute;n aparecer&aacute;n
      algunos iconos nuevos en la barra de herramientas, entre ellos el icono de <strong>cortar a
      ventana</strong>. Al pulsar sobre este icono <strong>se crea una nueva ventana de
      mapa</strong> en el escritorio <strong>y se pega la zona seleccionada</strong> en el mismo.
    </div>
    <br />
    <br />

    <p><strong>&iquest;Como se cortan y copian gr&aacute;ficos?</strong></p>

    <div>
      <img src="126.png" align="left" />Ver tambi&eacute;n la pregunta anterior. Para cortar y
      mover gr&aacute;ficos se debe acceder a la <strong>barra de edici&oacute;n de
      bloques</strong>, dentro del programa de dibujo, seleccionando el icono que muestra unas
      tijeras. <br />
      <br />

      <p>Desde el escritorio se pueden realizar algunas operaciones, como copiar un gr&aacute;fico
      a otro, esto se puede hacer arrastrando el primer gr&aacute;fico hasta el segundo.
      Tambi&eacute;n se puede crear una copia de un gr&aacute;fico si se arrastra el mismo hasta el
      tapiz de fondo (una zona del escritorio que no contenga ninguna ventana).</p>

      <p><strong>&iquest;Que debo hacer si el sistema se vuelve inestable?</strong></p>

      <p>DIV Games Studio es un programa muy complejo y, aunque es bastante s&oacute;lido en su
      ejecuci&oacute;n, puede que el alg&uacute;n equipo de alg&uacute;n error al realizar una
      acci&oacute;n determinada, o bien se bloquee el ordenador.</p>

      <p>En estos casos, para volver el sistema a su estado original, debe cargar DIV desde la
      l&iacute;nea de comandos de MSDOS indicando el par&aacute;metro <strong>/SAFE</strong>
      (introduciendo el comando D.EXE /SAFE desde el directorio en el que se instal&oacute; el
      programa), para entrar en el "Modo a prueba de fallos".</p>

      <p><strong>&iquest;Que debo hacer para aprender a programar?</strong></p>

      <p>Los conceptos b&aacute;sicos no se explican en esta ayuda, sino en el manual de usuario de
      DIV Games Studio 2, en los cap&iacute;tulos 4, 5 y 6.</p>

      <p>Adem&aacute;s se puede aprender mucho de los ejemplos de las funciones del lenguaje (ver
      la lista de funciones en la ayuda sobre el lenguaje) y de los tutoriales, que son unos
      mini-juegos muy sencillos y dise&ntilde;ados para facilitar el aprendizaje del lenguaje
      (estos tutoriales se pueden encontrar en el directorio PRG\TUTOR de DIV Games Studio 2).</p>

      <p><strong>&iquest;C&oacute;mo se cargan los gr&aacute;ficos en los juegos?</strong></p>

      <p>En un juego se pueden utilizar los gr&aacute;ficos contenidos en los mapas (archivos MAP o
      PCX), carg&aacute;ndolos de uno en uno con las funciones <a href="174.html">load_map()</a> o
      <a href="174.html">load_pcx</a>, o bien metiendo varios gr&aacute;ficos en un fichero FPG de
      gr&aacute;ficos y carg&aacute;ndolos despu&eacute;s con la funci&oacute;n <a
      href="132.html">load_fpg()</a>, esta &uacute;ltima opci&oacute;n tiene la ventaja de que se
      pueden cargar y descargar muchos gr&aacute;ficos de golpe en el juego.</p>

      <p>Despu&eacute;s se suelen utilizar los gr&aacute;ficos para asign&aacute;rselos a la
      variable <a href="1126.html">LOCAL graph</a> de los procesos del juego.</p>

      <p><strong>&iquest;Como mostrar un nuevo gr&aacute;fico en un juego?</strong></p>

      <p>Para crear un nuevo gr&aacute;fico o "sprite" en un juego, se debe primero crear un nuevo
      proceso (<a href="1016.html">PROCESS</a>) con las &oacute;rdenes que regir&aacute;n el
      comportamiento del mismo en el juego, despu&eacute;s cada vez que se quiera crear un proceso
      de dicho tipo, se deber&aacute; llamar al proceso (ver como se hace una <a
      href="1033.html">llamada a un proceso</a>).</p>

      <p><strong>&iquest;Como eliminar un proceso?</strong></p>

      <p>Para eliminar o "matar" a un proceso del juego, se puede ejecutar una sentencia <a
      href="1028.html">RETURN</a> desde el mismo o bien, desde otro proceso, enviarle una
      se&ntilde;al s_kill (ver la funci&oacute;n <a href="158.html">signal()</a>, que es la
      empleada para esto).</p>

      <p><strong>&iquest;Cuales son las funciones para manejar el rat&oacute;n?</strong></p>

      <p>El rat&oacute;n no se controla con ninguna funci&oacute;n, sino con la estructura global
      <a href="1100.html">mouse</a>, puede acceder a la ayuda sobre <strong>lenguaje</strong> /
      <strong>datos globales</strong> para ver el resto de estructuras que controlan otros aspectos
      importantes de los juegos.</p>

      <p><strong>&iquest;De donde carga todos los archivos DIV?</strong></p>

      <p>Cuando en un programa se llama a una funci&oacute;n como load_fpg( ... ) el gestor interno
      de DIV intenta localizar este archivo siguiendo el siguiente esquema (supongamos que se
      intenta cargar el archivo "DIR\FICHERO.EXT"):</p>

      <p>- Primero se sit&uacute;a donde se encuentra el ejecutable (EXE) del juego, o en el
      directorio principal de DIV (donde est&aacute; D.EXE) en caso de estar ejecutando el juego
      desde el entorno.</p>

      <p>- Despu&eacute;s se intenta abrir desde este directorio el archivo seg&uacute;n se ha
      especificado a la funci&oacute;n ("DIR\FICHERO.EXT").</p>

      <p>- En caso de no poder cargar este fichero, se intentar&aacute; cargar el fichero dentro de
      un directorio que tenga como nombre la extensi&oacute;n del propio fichero, es decir
      "EXT\DIR\FICHERO.EXT".</p>

      <p>- Si tampoco se ha encontrado este, se probar&aacute; a cargar el fichero sin indicar
      ninguna ruta, es decir "FICHERO.EXT".</p>

      <p>- Y por &uacute;ltimo, si no se ha localizado el fichero en ninguno de los anteriores
      directorios, se intentar&aacute; buscar directamente en el directorio cuyo nombre coincide
      con la extensi&oacute;n del fichero, obviando la ruta de acceso que se le pas&oacute; a la
      funci&oacute;n, es decir "EXT\FICHERO.EXT".</p>
    </div>
  </body>
</html>

