<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta name="generator" content="HTML Tidy, see www.w3.org" />

    <title>Ayuda de DIV 2 - Novedades del entorno en la versi&oacute;n 2.0</title>
    <meta name="keywords" content="div, div2" />
    <meta name="description" content="Ayuda en pantalla de DIV Games Studio 2" />
    <meta http-equiv="Content-Language" content="ES" />
    <meta name="author" content="Hammer Technologies" />
    <meta name="copyright" content="&copy; Copyright 1998,99 Hammer Technologies" />
    <meta name="generator" content="divhelp v0.1 &copy; 2007 Er_Makina" />
    <meta name="robots" content="all,follow,index" />
    <meta name="distribution" content="global" />
    <link href="estilo.css" rel="stylesheet" type="text/css" />
  </head>

  <body>
    <div class="botonera">
      <ul>
        <li><a class="botonindice" href="indice.html">&Iacute;ndice</a></li>

        <li><a class="botoninicio" href="3.html">Inicio</a></li>

        <li><a class="botonglosario" href="4.html">Glosario</a></li>

        <li><a class="botonfunciones" href="1032.html">Funciones</a></li>
      </ul>
    </div>

    <h1>Novedades del entorno en la versi&oacute;n 2.0</h1>

    <div align="center">
      <img src="6.png" />
    </div>

    <p><strong>M&aacute;s flexibilidad y sencillez de uso.</strong> El entorno de desarrollo de DIV
    Games Studio ha evolucionado en m&uacute;ltiples peque&ntilde;os aspectos, y entre todos
    conforman un interfaz a&uacute;n m&aacute;s intuitivo que el de la versi&oacute;n anterior.</p>
    <hr />

    <div>
      <img src="151.png" align="left" /><strong>Una nueva ayuda.</strong> La ayuda se ha
      actualizado, se ha estructurado mejor, y por supuesto contempla todas las novedades del
      lenguaje DIV. El formato de la ventana incluye una nueva barra de navegaci&oacute;n.
    </div>
    <br />
    <br />

    <div>
      <img src="154.png" align="left" /><strong>Multiples tama&ntilde;os de pincel.</strong> En el
      editor gr&aacute;fico se pueden seleccionar ahora pinceles de m&uacute;ltiples tama&ntilde;os
      y formas, monocromos o en escala de grises. Con la tecla <strong>T</strong> se accede al
      nuevo di&aacute;logo; se pueden a&ntilde;adir nuevos pinceles, a&ntilde;adi&eacute;ndolos al
      fichero <strong>BRUSH.FPG</strong> del directorio <strong>SYSTEM</strong>.
    </div>
    <br />
    <br />

    <div>
      <img src="155.png" align="left" /><strong>Dibujo con capas o texturas.</strong> En el editor
      gr&aacute;fico se accede con la tecla <strong>U</strong> a un nuevo di&aacute;logo en el que
      se puede seleccionar cualquiera de los mapas del escritorio como textura para pintar (con la
      tecla <strong>X</strong> se puede ver y desplazar esta textura). Se ha mejorado la
      herramienta del <strong>aerosol</strong>, la barra de <strong>puntos de control</strong>, y
      adem&aacute;s se han a&ntilde;adido <strong>nuevos comandos de teclado</strong> (como
      <strong>K</strong> para copiar un gr&aacute;fico a ventana, o <strong>+/-</strong> para
      cambiar de punto de control).
    </div>
    <br />
    <br />

    <div>
      <img src="156.png" align="left" /><strong>Visualizadores gr&aacute;ficos.</strong> Casi todas
      las ventanas para abrir archivos disponen de una casilla denominada
      <strong>Im&aacute;genes</strong> que permite visualizar el contenido de estos archivos antes
      de que sean cargados. Adem&aacute;s es posible <strong>cargar varios archivos de una
      s&oacute;la</strong> vez marcando estos con el rat&oacute;n mientras se mantiene la tecla
      <strong>Control</strong> pulsada (la tecla <strong>May&uacute;sculas</strong> permite marcar
      varios consecutivos).
    </div>
    <br />
    <br />

    <div>
      <img src="157.png" align="left" /><strong>Sistema mejorado de ficheros.</strong> En esta
      versi&oacute;n se ha mejorado la gesti&oacute;n interna de los FPG; se han eliminado errores,
      se pueden visualizar reducciones de los mapas contenidos, imprimir las listas, transferir un
      FPG completo a un mapa y viceversa.
    </div>
    <br />
    <br />

    <div>
      <img src="159.png" align="left" /><strong>Editor de efectos de sonido.</strong> El sistema de
      audio es completamente nuevo, permiti&eacute;ndose muchas m&aacute;s operaciones, formatos e
      incluy&eacute;ndose un <strong>mezclador</strong> y un <strong>editor de efectos</strong> de
      sonido. Se puede acceder a este editor a partir del men&uacute; de sonidos.
    </div>
    <br />
    <br />

    <div>
      <img src="160.png" align="left" /><strong>Evaluaci&oacute;n de expresiones.</strong> Ahora se
      puede acceder a las nuevas ventanas <strong>calculadoras</strong> (desde el men&uacute; de
      sistema) para evaluar expresiones num&eacute;ricas mientras se est&aacute; programando, sin
      salir del entorno.
    </div>
    <br />
    <br />

    <div>
      <img src="161.png" align="left" /><strong>Generador de sprites.</strong> El generador de
      personajes es tambi&eacute;n una nueva caracter&iacute;stica de esta versi&oacute;n. Se ha
      dise&ntilde;ado para ofrecer una base sobre la que realizar dibujos de seres humanos y
      animaciones realistas. Pudiendo ser posteriormente utilizados estos fotogramas en el editor
      gr&aacute;fico para realizar sobre los mismos cualquier tipo de modificaci&oacute;n.
    </div>
    <br />
    <br />

    <div>
      <img src="162.png" align="left" /><strong>Editor de mapas tridimensionales.</strong> El
      men&uacute; de mapas 3D, as&iacute; como el editor de estos y todas las funciones
      relacionadas con los mismos del lenguaje de programaci&oacute;n son una nueva
      caracter&iacute;stica de esta versi&oacute;n de DIV Games Studio.
    </div>
    <br />
    <br />

    <div>
      <img src="171.png" align="left" /><strong>Perfiles de tiempo.</strong> Desde el trazador de
      programas se puede acceder, pulsando F11, a los perfiles de tiempo del programa. Estas
      estad&iacute;sticas indican que est&aacute; consumiendo tiempo de proceso durante la
      ejecuci&oacute;n de un programa, y permiten la optimizaci&oacute;n de la velocidad de los
      programas manualmente.
    </div>
    <br />
    <br />

    <div>
      <img src="153.png" align="left" /><strong>Nuevos ejemplos.</strong> Se incluyen
      m&uacute;ltiples juegos y programas desarrollados por los usuarios con la versi&oacute;n
      anterior de DIV Games Studio. Adem&aacute;s, en el CD-ROM se podr&aacute;n encontrar
      m&uacute;ltiples utilidades shareware o de libre uso que complementan a este entorno de
      desarrollo.
    </div>
    <br />
    <br />

    <div>
      <img src="172.png" align="left" /><strong>Facilidad de impresi&oacute;n.</strong> Esta
      versi&oacute;n de DIV Games Studio permite imprimir, adem&aacute;s de los listados de los
      programas, las listas de gr&aacute;ficos contenidas en un FPG y las p&aacute;ginas de ayuda
      electr&oacute;nica.
    </div>
    <br />
    <br />

    <div>
      <img src="173.png" align="left" /><strong>Controles de volumen.</strong> Dentro de las
      mejoras incluidas en el sistema de audio, ahora existe un mejor control de los niveles de
      volumen, tanto en el entorno como en los progrmas. En el reproductor de CD aparece un
      peque&ntilde;o bot&oacute;n que da acceso al mezclador.
    </div>
    <br />
    <br />

    <div>
      <img src="174.png" align="left" /><strong>Librer&iacute;a de gr&aacute;ficos.</strong> Se ha
      ampliado y estructurado mejor la librer&iacute;a de gr&aacute;ficos incluida con el programa.
      Adem&aacute;s ahora se pueden importar mapas de cualquier n&uacute;mero de colores en
      formatos BMP, PCX o JPG.
    </div>
    <br />
    <br />

    <div>
      <img src="175.png" align="left" /><strong>Nuevo sistema de instalaci&oacute;n.</strong> El
      sistema de instalaci&oacute;n de los programas ha sido completamente redise&ntilde;ado,
      gener&aacute;ndose instalaciones protegidas contra modificaciones y m&aacute;s compactas,
      utilizando un <strong>interface gr&aacute;fico adaptable y m&aacute;s intuitivo</strong>.
    </div>
    <br />
    <br />
    <hr />

    <div>
      <img src="176.png" align="left" /><strong>Y un largo etc&eacute;tera.</strong> Existen muchas
      otras peque&ntilde;as mejoras en el entorno, muchas que pasar&aacute;n desapercibidas, pero
      que estan ah&iacute; haci&eacute;ndolo m&aacute;s potente y f&aacute;cil de utilizar. A
      continuaci&oacute;n se detallan algunas que pueden ser m&aacute;s relevantes.
    </div>
    <br />
    <br />

    <p>- Se ha <strong>optimizado el proceso de entrada y salida</strong> del entorno, as&iacute;
    como la ejecuci&oacute;n de los programas desde el m&iacute;smo, ahora las cargas son
    m&aacute;s r&aacute;pidas y los tiempos de espera m&aacute;s cortos.</p>

    <p>- El editor de programas muestra ahora los <strong>listados coloreados</strong>, resaltando
    las palabras clave del lenguaje, adem&aacute;s se puede configurar mejor definiendo, por
    ejemplo, el tama&ntilde;o de las tabulaciones.</p>

    <p>- Ahora, al entrar en el entorno, se podr&aacute; seleccionar si desea <strong>continuar con
    la sesi&oacute;n anterior</strong> o <strong>comenzar una nueva</strong>.</p>

    <p>- Es posible seleccionar <strong>m&aacute;s modos de visualizaci&oacute;n</strong> para el
    entorno, dependiendo de los modos soportados por su tarjeta de v&iacute;deo y el adaptador VESA
    instalado.</p>

    <p>- Un <strong>editor de gamas de colores</strong> facilita la generaci&oacute;n de
    explosiones (que ahora puede ser abortada) y la preparaci&oacute;n del tapiz de fondo (ahora se
    muestra una previsualizaci&oacute;n del mismo).</p>

    <p>- Se puede configurar la <strong>velocidad del puntero del rat&oacute;n</strong> con una
    peque&ntilde;a barra presente en la ventana de configuraci&oacute;n del men&uacute; de
    sistema.</p>

    <p>- En las ventanas de las fuentes <strong>aparece una muestra de letras</strong>,
    adem&aacute;s de indicarse que conjuntos de caracteres tienen definidos.</p>

    <p>- Es posible generar fuentes de <strong>letras con antidentado</strong>, simplemente creando
    las mismas con un reborde de 1 punto del color de fondo.</p>
    <hr />
    <strong>Ver tambi&eacute;n:</strong> <a href="2001.html">Novedades del lenguaje de
    programaci&oacute;n</a>
  </body>
</html>

