<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta name="generator" content="HTML Tidy, see www.w3.org" />

    <title>Ayuda de DIV 2 - Trabajando con las ventanas</title>
    <meta name="keywords" content="div, div2" />
    <meta name="description" content="Ayuda en pantalla de DIV Games Studio 2" />
    <meta http-equiv="Content-Language" content="ES" />
    <meta name="author" content="Hammer Technologies" />
    <meta name="copyright" content="&copy; Copyright 1998,99 Hammer Technologies" />
    <meta name="generator" content="divhelp v0.1 &copy; 2007 Er_Makina" />
    <meta name="robots" content="all,follow,index" />
    <meta name="distribution" content="global" />
    <link href="estilo.css" rel="stylesheet" type="text/css" />
  </head>

  <body>
    <div class="botonera">
      <ul>
        <li><a class="botonindice" href="indice.html">&Iacute;ndice</a></li>

        <li><a class="botoninicio" href="3.html">Inicio</a></li>

        <li><a class="botonglosario" href="4.html">Glosario</a></li>

        <li><a class="botonfunciones" href="1032.html">Funciones</a></li>
      </ul>
    </div>

    <h1>Trabajando con las ventanas</h1>

    <p>Las ventanas, pueden desplazarse hacia cualquier posici&oacute;n de pantalla si se pulsa
    sobre la barra de t&iacute;tulo con el rat&oacute;n y se arrastra hasta la nueva
    posici&oacute;n.</p>

    <p><strong>Barra de t&iacute;tulo.</strong> - Es la zona superior de las ventanas, donde se
    muestra su nombre en color blanco sobre fondo azul. Cuando el nombre de la ventana aparece en
    colores grises, es porque la ventana no est&aacute; seleccionada (debido a que habr&aacute;
    alguna de su misma categor&iacute;a que lo est&eacute;), para seleccionarla bastar&aacute; con
    pulsar sobre ella.</p>

    <p><strong>Arrastrar.</strong> - Este t&eacute;rmino se aplica dentro del entorno
    gr&aacute;fico a la acci&oacute;n de pulsar con el rat&oacute;n sobre un objeto, desplazarlo a
    una nueva posici&oacute;n, y finalmente soltar el bot&oacute;n del rat&oacute;n.</p>

    <p>Para pedir al sistema que coloque una ventana autom&aacute;ticamente, se debe realizar una
    doble pulsaci&oacute;n con el rat&oacute;n sobre la barra de t&iacute;tulo de la ventana. Si el
    sistema encuentra una posici&oacute;n mejor para la ventana, la desplazar&aacute; hasta
    ella.</p>

    <p>Las ventanas pueden estar en <strong>diferentes modos</strong>, y en funci&oacute;n del
    mismo su operatividad sera distinta. A continuaci&oacute;n se describen estos modos:</p>

    <p><strong>1. Ventanas activas:</strong> Son las que tienen, normalmente, si no se cambia la
    configuraci&oacute;n de colores, la barra de t&iacute;tulo iluminada, en letras blancas sobre
    fondo azul y est&aacute;n sobre las dem&aacute;s en el escritorio.</p>

    <p><strong>2. Ventanas inactivas:</strong> Este tipo de ventanas tienen la barra de
    t&iacute;tulo oscurecida, en letras negras sobre fondo gris oscuro. Para activar una de estas
    ventanas bastar&aacute; con pulsar sobre ellas.</p>

    <p><strong>3. Ventanas en segundo plano:</strong> Son ventanas que est&aacute;n oscurecidas;
    esto es debido a que est&aacute;n, al menos parcialmente, tapadas por otras ventanas. Con estas
    ventanas no se podr&aacute; interaccionar hasta que no se pasen a primer plano pulsando con el
    rat&oacute;n sobre ellas.</p>

    <p><strong>4. Iconos:</strong> Los iconos son las ventanas que se ha minimizado, es decir, que
    se han reducido temporalmente. Los iconos no muestran ning&uacute;n dibujo, &uacute;nicamente
    un bot&oacute;n con un signo "+" seguido del t&iacute;tulo de la ventana.</p>

    <p><strong>Nota:</strong> Para arrastrar los gr&aacute;ficos (a un fichero, al escritorio,
    etc.) no se debe pulsar sobre la barra de t&iacute;tulo de la ventana (con lo que se
    arrastrar&iacute;a la misma), si no sobre el contenido de la ventana. Es decir, que hay que
    pulsar m&aacute;s o menos en el centro de la ventana y, sin soltar el bot&oacute;n del
    rat&oacute;n, desplazarlo a la nueva posici&oacute;n.</p>
    <hr />
    Ver: <a href="2006.html">Tipos de ventanas</a> - <a href="2000.html">Introducci&oacute;n a DIV
    2</a>
  </body>
</html>

