<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta name="generator" content="HTML Tidy, see www.w3.org" />

    <title>Ayuda de DIV 2 - Tipos de ventanas</title>
    <meta name="keywords" content="div, div2" />
    <meta name="description" content="Ayuda en pantalla de DIV Games Studio 2" />
    <meta http-equiv="Content-Language" content="ES" />
    <meta name="author" content="Hammer Technologies" />
    <meta name="copyright" content="&copy; Copyright 1998,99 Hammer Technologies" />
    <meta name="generator" content="divhelp v0.1 &copy; 2007 Er_Makina" />
    <meta name="robots" content="all,follow,index" />
    <meta name="distribution" content="global" />
    <link href="estilo.css" rel="stylesheet" type="text/css" />
  </head>

  <body>
    <div class="botonera">
      <ul>
        <li><a class="botonindice" href="indice.html">&Iacute;ndice</a></li>

        <li><a class="botoninicio" href="3.html">Inicio</a></li>

        <li><a class="botonglosario" href="4.html">Glosario</a></li>

        <li><a class="botonfunciones" href="1032.html">Funciones</a></li>
      </ul>
    </div>

    <h1>Tipos de ventanas</h1>

    <p>Las ventanas se pueden clasificar seg&uacute;n su funci&oacute;n, realiz&aacute;ndose las
    siguientes agrupaciones:</p>

    <p><strong>1. Di&aacute;logos interactivos:</strong> &Eacute;stos son los cuadros que se
    utilizan para solicitar informaci&oacute;n al usuario; existe una gran variedad de ellos, por
    lo que ya se ir&aacute;n viendo en las respectivas opciones</p>

    <p><strong>2. Cuadros de error:</strong> Son di&aacute;logos en los que la barra de
    t&iacute;tulo aparece en blanco sobre rojo e informan de alg&uacute;n problema que se haya
    producido.</p>

    <p><strong>3. Men&uacute;s de opciones:</strong> Los men&uacute;s son una lista de opciones que
    llaman a otros men&uacute;s, ventanas o di&aacute;logos al pulsar sobre ellas. Todos los
    men&uacute;s parten del men&uacute; principal. Algunos men&uacute;s tienen ciertas opciones
    desactivadas (se muestra un puntero con un s&iacute;mbolo prohibido al situar el rat&oacute;n
    sobre ellas); esto es debido a que dichas opciones interact&uacute;an con un tipo de ventanas
    en concreto, y no hay ninguna ventana de dicho tipo activa (se debe antes crear o cargar
    una).</p>

    <p><strong>4. Programas:</strong> En estas ventanas es donde se crean los programas y son
    ventanas de edici&oacute;n de texto. Para editar un programa debe estar su ventana activada
    (s&oacute;lo uno de los programas cargados puede estar activado). La edici&oacute;n de texto es
    muy similar a otros editores de texto (soporta el est&aacute;ndar EDIT entre ellos).</p>

    <p>Para pedir ayuda en un programa sobre una palabra del lenguaje hay que situar el cursor
    parpadeante de edici&oacute;n (no el puntero del rat&oacute;n) sobre la misma y,
    despu&eacute;s, pulsar la tecla <strong>F1</strong>. Estas ventanas pueden cambiarse de
    tama&ntilde;o pulsando en el bot&oacute;n inferior derecho de las mismas y arrastrando con el
    rat&oacute;n o pulsando <strong>Control</strong>+<strong>Z</strong>.</p>

    <p><strong>5. Mapas o gr&aacute;ficos:</strong> Estas ventanas son las que contienen un mapa
    (bitmap) o gr&aacute;fico (un dibujo de los empleados en un juego) y se controlan por medio del
    men&uacute; de mapas. Pueden cargarse de un archivo MAP (formato propio), importarse de un
    archivo PCX, BMP o JPG. Para editar los gr&aacute;ficos se debe realizar una doble
    pulsaci&oacute;n del bot&oacute;n del rat&oacute;n en el centro de estas ventanas entrando, de
    este modo, en el editor gr&aacute;fico (descrito en el <strong>manual de usuario</strong>).
    Estos gr&aacute;ficos pueden arrastrarse hasta el tapiz (para hacer una copia), hasta otro
    gr&aacute;fico (para insertarlos), hasta un fichero de gr&aacute;ficos (para incluirlos) o
    hasta la papelera (para borrarlos), para ello se debe arrastrar desde el centro de las
    ventanas, en lugar de la barra de t&iacute;tulo.</p>

    <p><strong>6. Mapas 3D:</strong> Estos son los mapas vectoriales creados en el editor de mapas
    3D, en su ventana se muestran como un conjunto de pol&iacute;gonos cerrados representando el
    alzado de un plano. Su creaci&oacute;n no es trivial, y se describe en el <strong>manual de
    usuario</strong>. Estos mapas se guardan en disco en los archivos con extensi&oacute;n WLD.</p>

    <p><strong>7. FPG o Ficheros para gr&aacute;ficos:</strong> Estas ventanas muestran el
    contenido de un fichero del disco. Son librer&iacute;as o colecciones de gr&aacute;ficos
    utilizadas en los juegos; su utilidad reside en no tener que cargar en un juego una gran
    cantidad de mapas por separado. Tienen dos modos b&aacute;sicos de funcionamiento, activados
    mediante una casilla denominada "Info" en su parte inferior. Cuando esta casilla no est&aacute;
    activada (por defecto) se pueden marcar y desmarcar una serie de gr&aacute;ficos sobre la que
    pretende realizar una operaci&oacute;n, o bien arrastrar gr&aacute;ficos hacia fuera del
    fichero (hacia el tapiz, otros ficheros, mapas o la papelera). Cuando dicha casilla est&aacute;
    activada se pueden editar los c&oacute;digos de los gr&aacute;ficos y sus descripciones. Estos
    FPG se controlan siempre mediante el men&uacute; de ficheros.</p>

    <p>Las ventanas de los FPG son siempre un reflejo directo del "fichero para gr&aacute;ficos"
    contenido en el disco duro del ordenador, por ello pueden cerrarse en cualquier momento, sin
    tener que guardarlas previamente. No se perder&aacute; nunca su contenido. La opci&oacute;n
    <strong>Ficheros \ Guardar</strong> como permite hacer una copia del FPG con otro nombre
    distinto (como copia temporal o de seguridad).</p>

    <p><strong>8. Fuentes de letras:</strong> Las fuentes o tipos de letra son unas ventanas
    peque&ntilde;as que representan una tipograf&iacute;a concreta. Se debe pulsar sobre ellas para
    ver una muestra del fuente a tama&ntilde;o real. Se corresponden con archivos FNT (formato
    propio) y son controladas por el men&uacute; de fuentes, desde el cual se puede acceder al
    generador de fuentes que es la herramienta utilizada para crear nuevas fuentes de letras. Las
    fuentes de letras se utilizan dentro del programa de dibujo y en los programas para escribir
    textos.</p>

    <p><strong>9. Efectos de sonido:</strong> Representan en pantalla un archivo PCM (pulse code
    modulation) o WAV con un efecto de sonido. Se controlan mediante el men&uacute; de sonidos,
    pudiendo crearse efectos nuevos (con la grabadora de sonidos) o editarse. Se puede encontrar
    una librer&iacute;a de efectos de sonido ya preparados para su utilizaci&oacute;n en los
    juegos. Para escuchar un efecto de sonido se debe tener una tarjeta de sonido compatible con
    las familias Sound Blaster o Gravis Ultrasound correctamente configurada y pulsar sobre una de
    estas ventanas.</p>

    <p><strong>10. M&oacute;dulos musicales:</strong> Se pueden cargar canciones en los formatos
    MOD, S3M y XM. Estas se representan en una peque&ntilde;a ventana que permite activar o parar
    su reproducci&oacute;n. No siendo posible componer estos m&oacute;dulos desde el propio
    entorno.</p>

    <p><strong>11. Ventana de ayuda:</strong> Se controla principalmente con el rat&oacute;n,
    pudiendo utilizar tambi&eacute;n los cursores, las teclas de avance y retroceso p&aacute;gina y
    la tecla Borrar para volver a la p&aacute;gina anterior (es la tecla que est&aacute; sobre
    Enter). En las ventanas de ayuda se muestran en blanco los textos que hacen referencia a otras
    p&aacute;ginas de ayuda. Se debe pulsar sobre estas referencias para acceder a dichas
    p&aacute;ginas. En las ventanas de ayuda tambi&eacute;n se muestran programas de ejemplo que se
    pueden extraer pulsando sobre su t&iacute;tulo, ejecutar con la tecla F10 y abortar pulsando
    ALT+X.</p>

    <p><strong>12. Calculadoras:</strong> Las ventanas de las calculadoras funcionan como
    evaluadores de expresiones matem&aacute;ticas, al estilo de las expresiones presentes en los
    programas. Su funcionamiento es muy simple, ya que basta con introducir una expresi&oacute;n y
    pulsar Enter para ver el resultado. Pudi&eacute;ndose utilizar par&eacute;ntesis para indicar
    subexpresiones.</p>

    <p><strong>Nota:</strong> La ventana de la papelera se debe activar primero a partir del
    men&uacute; de sistema, con la opci&oacute;n correspondiente (<strong>Sistema \
    Papelera</strong>) del mismo.</p>
    <hr />
    Ver: <a href="2010.html">Fijando un modo de video</a> - <a href="2000.html">Introducci&oacute;n
    a DIV 2</a>
  </body>
</html>

