<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta name="generator" content="HTML Tidy, see www.w3.org" />

    <title>Ayuda de DIV 2 - Fijando un modo de video</title>
    <meta name="keywords" content="div, div2" />
    <meta name="description" content="Ayuda en pantalla de DIV Games Studio 2" />
    <meta http-equiv="Content-Language" content="ES" />
    <meta name="author" content="Hammer Technologies" />
    <meta name="copyright" content="&copy; Copyright 1998,99 Hammer Technologies" />
    <meta name="generator" content="divhelp v0.1 &copy; 2007 Er_Makina" />
    <meta name="robots" content="all,follow,index" />
    <meta name="distribution" content="global" />
    <link href="estilo.css" rel="stylesheet" type="text/css" />
  </head>

  <body>
    <div class="botonera">
      <ul>
        <li><a class="botonindice" href="indice.html">&Iacute;ndice</a></li>

        <li><a class="botoninicio" href="3.html">Inicio</a></li>

        <li><a class="botonglosario" href="4.html">Glosario</a></li>

        <li><a class="botonfunciones" href="1032.html">Funciones</a></li>
      </ul>
    </div>

    <h1>Fijando un modo de video</h1>

    <p>La opci&oacute;n <strong>Sistema \ Modo de v&iacute;deo</strong> da acceso a un cuadro de
    di&aacute;logo que permite modificar la resoluci&oacute;n utilizada por el entorno
    gr&aacute;fico de DIV Games Studio 2.</p>

    <p>Las resoluciones de v&iacute;deo se indican como el n&uacute;mero de puntos en horizontal y
    vertical existentes en la pantalla en dicho modo y var&iacute;an entre 320x200 (baja
    resoluci&oacute;n) y la resoluci&oacute;n m&aacute;xima que permita su tarjeta de v&iacute;deo.
    Para seleccionar una nueva resoluci&oacute;n se debe pulsar sobre la lista que aparece en el
    cuadro y despu&eacute;s en el bot&oacute;n de <strong>Aceptar</strong>.</p>

    <p><strong>Nota:</strong> Algunos de estos modos de v&iacute;deo pueden visualizarse
    incorrectamente (por ejemplo, una resoluci&oacute;n que est&eacute; permitida por su tarjeta de
    v&iacute;deo pero no por su monitor); en estos casos se deber&aacute; esperar unos <strong>15
    segundos</strong> para que el entorno recupere la resoluci&oacute;n anterior. No debe pulsar
    ninguna tecla, ni realizar ninguna acci&oacute;n, simplemente espere.</p>

    <p><strong>Selecci&oacute;n de la fuente del sistema.</strong></p>

    <p>Dos casillas permiten seleccionar la fuente utilizada por el sistema, existiendo dos
    posibilidades que no s&oacute;lo difieren en el tama&ntilde;o de las letras sino, en general,
    en el tama&ntilde;o de todas las ventanas del entorno.</p>

    <p><strong>1. Fuente peque&ntilde;a (y ventanas peque&ntilde;as).</strong> En este modo todas
    las ventanas, men&uacute;s y cuadros se ver&aacute;n en un tama&ntilde;o menor, siendo el
    apropiado para modos de baja resoluci&oacute;n o equipos con un monitor lo suficientemente
    grande.</p>

    <p><strong>2. Fuente grande (y ventanas grandes).</strong> Este modo podr&aacute; ser activado
    &uacute;nicamente en resoluciones a partir de 640x480 y es el apropiado para estas resoluciones
    en monitores peque&ntilde;os.</p>

    <p><strong>Nota:</strong> La fuente de letras utilizada en los programas y en la ventana de
    ayuda es independiente de la seleccionada para el sistema, y se define en la ventana de
    configuraci&oacute;n, accesible tambi&eacute;n desde este mismo men&uacute; de sistema.</p>
    <hr />
    Ver: <a href="2011.html">La ventana de configuraci&oacute;n</a> - <a
    href="2000.html">Introducci&oacute;n a DIV 2</a>
  </body>
</html>

