<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta name="generator" content="HTML Tidy, see www.w3.org" />

    <title>Ayuda de DIV 2 - La ventana de configuraci&oacute;n</title>
    <meta name="keywords" content="div, div2" />
    <meta name="description" content="Ayuda en pantalla de DIV Games Studio 2" />
    <meta http-equiv="Content-Language" content="ES" />
    <meta name="author" content="Hammer Technologies" />
    <meta name="copyright" content="&copy; Copyright 1998,99 Hammer Technologies" />
    <meta name="generator" content="divhelp v0.1 &copy; 2007 Er_Makina" />
    <meta name="robots" content="all,follow,index" />
    <meta name="distribution" content="global" />
    <link href="estilo.css" rel="stylesheet" type="text/css" />
  </head>

  <body>
    <div class="botonera">
      <ul>
        <li><a class="botonindice" href="indice.html">&Iacute;ndice</a></li>

        <li><a class="botoninicio" href="3.html">Inicio</a></li>

        <li><a class="botonglosario" href="4.html">Glosario</a></li>

        <li><a class="botonfunciones" href="1032.html">Funciones</a></li>
      </ul>
    </div>

    <h1>La ventana de configuraci&oacute;n</h1>

    <p>Mediante la opci&oacute;n <strong>Sistema\Configuraci&oacute;n</strong> se acceder&aacute; a
    un cuadro de di&aacute;logo dividido en varias secciones, que se muestran a
    continuaci&oacute;n.</p>

    <p><strong>Colores de ventanas</strong></p>

    <p>Esta primera secci&oacute;n establece los colores utilizados por el entorno; se pueden
    indicar los colores para el fondo de las ventanas, la tinta para las letras y el color de la
    barra de t&iacute;tulo. Para cambiar estos colores se debe pulsar sobre las cajas. El sistema
    no s&oacute;lo utiliza estos tres colores sino que, a partir de ellos, genera una gama de
    colores intermedios para los textos, cursores, botones, etc.</p>

    <p><strong>Editor de programas</strong></p>

    <p>Establece la apariencia de las ventanas de edici&oacute;n de programas. Se pueden
    seleccionar colores variados para los diferentes objetos (palabras o s&iacute;mbolos) presentes
    en los programas.</p>

    <p><strong>1.</strong> Fondo de la ventana de edici&oacute;n.<br />
    <strong>2.</strong> Tinta general para las letras.<br />
    <strong>3.</strong> Cursor de edici&oacute;n.<br />
    <strong>4.</strong> Comentarios explicativos de los programas.<br />
    <strong>5.</strong> S&iacute;mbolos y operadores de expresiones.<br />
    <strong>6.</strong> Palabras reservadas del lenguaje.<br />
    <strong>7.</strong> N&uacute;meros dentro del programa.<br />
    <strong>8.</strong> Literales, o textos entre comillas.<br />
    </p>

    <p>Los bloques de texto marcados dentro del editor se ver&aacute;n con los colores de tinta y
    fondo intercambiados.</p>

    <p>Una caja de texto permite definir el tama&ntilde;o (en n&uacute;mero de espacios) del
    tabulador en el editor de programas, como un n&uacute;mero entre 1 y 16. Afectando a este al
    indentado de las sentencias en el lenguaje. Por defecto se tabula cada 4 columnas.</p>

    <p>Tambi&eacute;n es posible seleccionar aqu&iacute; el tama&ntilde;o de las letras de los
    programas y la ayuda, desde 6x8 hasta 9x16 puntos. Todas las fuentes de letras para
    edici&oacute;n son de espaciado fijo.</p>

    <p><strong>Programa de dibujo</strong></p>

    <p>Se define la cantidad de memoria reservada para deshacer opciones en el editor
    gr&aacute;fico, la velocidad del puntero de rat&oacute;n y su representaci&oacute;n.</p>

    <p>La cantidad de "memoria de deshacer" se especifica en Kbytes, por defecto es 1088Kb (algo
    m&aacute;s de un mega), y no es necesario modificar este valor a no ser que no se pueda
    realizar una operaci&oacute;n en el editor gr&aacute;fico por falta de memoria de deshacer (en
    cuyo caso el programa advertir&aacute; de ello). Cuanta m&aacute;s memoria de deshacer se
    reserve, menos memoria quedar&aacute; disponible en el sistema para el resto de acciones.</p>

    <p>La velocidad del puntero del rat&oacute;n se define con una peque&ntilde;a barra horizontal
    (m&aacute;s r&aacute;pido a la izquierda y mas lento a la derecha), y afecta a todo el entorno
    de ventanas, no s&oacute;lo al programa de dibujo.</p>

    <p><strong>Opciones globales del entorno</strong></p>

    <p><strong>1. Ventanas emergentes.</strong> Indica que todos los movimientos de ventanas deben
    ser visualizados, cuando se abren, se cierren, se minimicen, etc. Si se desactiva esta
    opci&oacute;n, el entorno perder&aacute; efectismo pero ganar&aacute; velocidad de
    respuesta.</p>

    <p><strong>2. Mover ventanas completas.</strong> Indica que al arrastrarse las ventanas a una
    nueva posici&oacute;n se debe ver en todo momento el resultado final. Puede ser conveniente
    desactivar esta opci&oacute;n en los equipos m&aacute;s lentos.</p>

    <p><strong>3. Guardar sesi&oacute;n siempre.</strong> Indica que al salir de DIV Games Studio
    se debe guardar el estado del escritorio y todos sus objetos (programas, mapas, sonidos, etc.).
    Si se desactiva esta opci&oacute;n la entrada y salida del entorno ser&aacute; m&aacute;s
    r&aacute;pida, pero se puede correr el riesgo de perder trabajos que no hayan sido
    guardados.</p>

    <p><strong>4. Colorear los listados.</strong> Indica que, cuando se est&eacute; editando un
    archivo con extensi&oacute;n PRG, se deben aplicar todos los colores anteriormente
    seleccionados para el editor. En caso contrario se aplicar&aacute;n &uacute;nicamente los
    colores de fondo, tinta y cursor. Al igual que cuando se edite un archivo que no sea un
    PRG.</p>

    <p><strong>Nota:</strong> Si se cierra la ventana de configuraci&oacute;n o se pulsa la tecla
    ESC se perder&aacute;n todos los cambios realizados en la misma, restableci&eacute;ndose los
    valores de la configuraci&oacute;n anterior.</p>
    <hr />
    Ver: <a href="2012.html">Toma de contacto con el lenguaje</a> - <a
    href="2000.html">Introducci&oacute;n a DIV 2</a>
  </body>
</html>

