<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta name="generator" content="HTML Tidy, see www.w3.org" />

    <title>Ayuda de DIV 2 - Toma de contacto con el lenguaje</title>
    <meta name="keywords" content="div, div2" />
    <meta name="description" content="Ayuda en pantalla de DIV Games Studio 2" />
    <meta http-equiv="Content-Language" content="ES" />
    <meta name="author" content="Hammer Technologies" />
    <meta name="copyright" content="&copy; Copyright 1998,99 Hammer Technologies" />
    <meta name="generator" content="divhelp v0.1 &copy; 2007 Er_Makina" />
    <meta name="robots" content="all,follow,index" />
    <meta name="distribution" content="global" />
    <link href="estilo.css" rel="stylesheet" type="text/css" />
  </head>

  <body>
    <div class="botonera">
      <ul>
        <li><a class="botonindice" href="indice.html">&Iacute;ndice</a></li>

        <li><a class="botoninicio" href="3.html">Inicio</a></li>

        <li><a class="botonglosario" href="4.html">Glosario</a></li>

        <li><a class="botonfunciones" href="1032.html">Funciones</a></li>
      </ul>
    </div>

    <h1>Toma de contacto con el lenguaje</h1>

    <p>En esta secci&oacute;n se explicar&aacute; c&oacute;mo ejecutar los juegos ejemplo de DIV
    Games Studio y unas instrucciones r&aacute;pidas para que vd. pueda comenzar a investigar sobre
    ellos, adquiriendo de esta forma las primeras nociones de este lenguaje de
    programaci&oacute;n.</p>

    <p><strong>Instrucciones generales</strong></p>

    <p>Todos los juegos incluidos son simples ejemplos, cuya complejidad no pretende competir con
    los juegos comerciales que pueden ser creados con esta herramienta. Aunque se trate de juegos
    completos, la mayor&iacute;a son muy sencillos o muy cortos.</p>

    <p>El motivo es que se ha pretendido mostrar las t&eacute;cnicas que emplean y c&oacute;mo se
    realizan los programas, ofreciendo con ellos un bot&oacute;n de muestra, en lugar de enormes
    listados en los que el lector se pierda.</p>

    <p><strong>Nota:</strong> Estos juegos no pueden nunca mostrar las posibilidades reales de este
    entorno de desarrollo, ya que pr&aacute;cticamente ning&uacute;n juego las utiliza. La gran
    mayor&iacute;a de las nuevas y potentes capacidades de esta versi&oacute;n de DIV Games Studio
    no han sido utilizadas en ning&uacute;n ejemplo, d&aacute;ndole a vd. la posibilidad de ser de
    los primeros que intenten, o quiz&aacute; logren, exprimirlas al m&aacute;ximo.</p>

    <p>Para ejecutar cualquiera de los ejemplos se debe, primero, cargar el programa con la
    opci&oacute;n <strong>Programas\Abrir programa</strong>, con lo que aparecer&aacute; una
    ventana con el listado del programa cargado.</p>

    <p><strong>El sistema de ayuda</strong></p>

    <p>Una de las mejores opciones es investigar, examinando los programas e intentando realizar
    alg&uacute;n cambio en ellos; al situarse sobre cualquier palabra reservada, constante,
    variable, funci&oacute;n, etc., del lenguaje se puede pulsar la tecla F1 para ver una
    p&aacute;gina de ayuda sobre dicho objeto.</p>

    <p>Si, al pulsar F1, no apareciera la ayuda sobre el objeto (sino que aparece el &iacute;ndice
    general), es porque &eacute;ste no es un nombre propio del lenguaje DIV, sino que se trata de
    alg&uacute;n dato o proceso exclusivo del juego (los procesos son una especie de funciones que
    rigen el comportamiento de los gr&aacute;ficos, o 'sprites', en los juegos).</p>

    <p><strong>Nota:</strong> Se recomienda comenzar a examinar juegos sencillos, como los
    tutoriales o, sobre todo, los ejemplos incluidos en la ayuda electr&oacute;nica; para acceder a
    ellos debe pulsar el bot&oacute;n denominado Funciones de la ventana de ayuda y, desde esa
    p&aacute;gina, ir accediendo a las diferentes explicaciones de las funciones del lenguaje de
    programaci&oacute;n, de donde se pueden extraer peque&ntilde;os ejemplos pulsando sobre su
    cabecera o titular.</p>

    <p>Los textos que comienzan con el s&iacute;mbolo // (doble barra) son comentarios
    explicativos, no forman parte del programa, sino que &uacute;nicamente consisten en "notas
    aclaratorias" sobre el funcionamiento interno del programa. Estos comentarios suelen ser de
    gran ayuda para comprender el funcionamiento de los programas. Tambi&eacute;n pueden aparecer
    comentarios entre los s&iacute;mbolos /* y */ (a lo largo de varias l&iacute;neas del
    programa).</p>

    <p>Para irse a uno de los procesos del programa (uno de los bloques que tienen los programas
    para controlar un gr&aacute;fico o sprite del juego) se debe pulsar la tecla F5 y seleccionar
    el nombre del proceso en cuesti&oacute;n con el rat&oacute;n.</p>

    <p><strong>Ejecuci&oacute;n de los ejemplos</strong></p>

    <p>Para ejecutar uno de los programas cargados, se debe pulsar con el rat&oacute;n sobre su
    ventana y despu&eacute;s la tecla F10 (esta acci&oacute;n tambi&eacute;n se puede realizar con
    la opci&oacute;n Programas \ Ejecutar).</p>

    <p>Las instrucciones de los juegos var&iacute;an de unos a otros, pero la mayor&iacute;a
    permiten salir pulsando la tecla ESC y se manejan mayoritariamente con las teclas de los
    cursores y la tecla Control (ver los <a href="1292.html">comandos comunes en los
    juegos</a>).</p>

    <p>La tecla de Pausa se podr&aacute; utilizar en todos los juegos para detener su
    ejecuci&oacute;n moment&aacute;neamente. Todos los programas pueden abortarse en cualquier
    punto, independientemente de su programaci&oacute;n, si se pulsa la combinaci&oacute;n de
    teclas ALT+X.</p>
    <hr />
    Ver: <a href="2013.html">Trazando los programas</a> - <a href="2000.html">Introducci&oacute;n a
    DIV 2</a>
  </body>
</html>

